Repository: emutos/emutos
Catalog: po/*.po
Languages: ca, cs, pl, ro, tr

source: MDY
ca: MDA
cs: MDR
pl: MDR
ro: LZA
tr: AGY

source: DMY
ca: DMA
cs: DMR
pl: DMR
ro: ZLA
tr: GAY

source: SET FILE MASK
ca: ESTABLEIX MÀSCARA DE FITXER
cs: NASTAVIT MASKU SOUBORÙ
pl: USTAW MASKÊ PLIKU
ro: SETAÞI MASCA DE FIªIER
tr: DOSYA MASKESÝ AYARLA

source: DESKTOP CONFIGURATION
ca: CONFIGURACIó D'ESCRIPTORI
cs: KONFIGURACE DESKTOPU
pl: KONFIGURACJA PULPITU
ro: CONFIGURAÞIE DE BIROU
tr: MASAÜSTÜ AYARLARI

source: Function keys:
ca: Tecles de funció:
cs: Funkèní klávesy:
pl: Klawisze funkcji:
ro: Tastele de funcþie:
tr: Fonksiyon tuþlarý:

source: Menu shortcut keys:
ca: Tecles de drecera de menú:
cs: Klávesové zkratky:
pl: Skróty klawiszowe menu:
ro: Com. rapidã din meniu:
tr: Menü kýsayol tuþu:

source: Clear all
ca: Esborra tot
cs: Vymazat v¹e
pl: Wyczy¶æ wszystkie
ro: ªtergeþi toate
tr: Hepsini sil

source: SET SCREEN RESOLUTION
ca: ESTABLEIX RESOLUCIó DE PANTALLA
cs: ROZLI©ENÍ OBRAZOVKY
pl: USTAW ROZDZIELCZO¦Æ
ro: SETAÞI REZOLUÞIA ECRANULUI
tr: ÇÖZÜNÜRLÜK AYARLAYIN

source: ST Low
ca: ST baixa
cs: ST nízké
pl: ST Niskie
ro: ST scãzutã
tr: ST Düþük

source: ST Medium
ca: ST mitjà
cs: ST støední
pl: ST ¦rednie
ro: ST medie
tr: ST Orta

source: ST High
ca: ST alta
cs: ST vysoké
pl: ST Wysokie
ro: ST înaltã
tr: ST Yüksek

source: TT Low
ca: TT baixa
cs: TT nízké
pl: TT Niskie
ro: TT scãzutã
tr: TT Düþük

source: TT Medium
ca: TT mitjà
cs: TT støední
pl: TT ¦rednie
ro: TT medie
tr: TT Orta

source: High
ca: Alta
cs: Vysoké
pl: Wysokie
ro: Înaltã
tr: Yüksek

source: Medium
ca: Mitjà
cs: Støední
pl: ¦rednie
ro: Medie
tr: Orta

source: Low
ca: Baixa
cs: Nízké
pl: Niskie
ro: Scãzutã
tr: Düþük

source: ST Compatible
ca: Compat. amb ST
cs: ST kompatibilní
pl: Komp. z ST
ro: Compatibil ST
tr: ST uyumlu

source: INSTALL WINDOW ICON
ca: INSTAL·LA ICONA DE FINESTRA
cs: INSTALOVAT IKONU OKNA
pl: DODAJ IKONÊ OKNA
ro: INSTALAÞI ICOANA DE FEREASTRÃ
tr: PENCERE SÝMGESÝ KUR

source: Folder
ca: Carpeta
cs: Adresáø
ro: Dosar
tr: Klasör

source: File
ca: Fitxer
cs: Soubor
pl: Plik
ro: Fiºier
tr: Dosya

source: Monochrome only
ca: Només monocrom
cs: Pouze monochrom
pl: Tylko cz.-b.
ro: Doar monocromie
tr: Yalnýzca siyah-beyaz

source: FORMAT FLOPPY DISKETTE
ca: FORMATA DISQUET
cs: FORMÁTOVAT FLOPPY DISK
pl: FORMATUJ DYSKIETKÊ
ro: FORMATAÞI DISCHETA
tr: DÝSKET BÝÇÝMLENDÝR

source: SET BACKGROUND
ca: ESTABLEIX FONS
cs: NASTAVIT POZADÍ
pl: USTAW T£O
ro: SETAÞI FUNDALUL
tr: ARKA PLANI AYARLA

source: Select:
ca: Selecciona:
cs: Výbìr:
pl: Wybierz:
ro: Selectaþi:
tr: Seçim:

source: Desktop
ca: Escriptori
pl: Pulpit
ro: Birou
tr: Masaüstü

source: Style:
ca: Estil:
cs: Styl:
pl: Styl:
ro: Stil:
tr: Tarz:

source: Color:
cs: Barva:
pl: Kolor:
ro: Culoare:
tr: Renk:

source: %ld bytes used in %d items.
ca: %ld bytes utilitzats en %d elements.
cs: %ld bytù v %d polo¾kách.
pl: %ld bajty/ów u¿yte przez %d przedm.
ro: %ld byte utilizaþi în %d de articole.
tr: %ld bayt %d nesne kullanýyor.

source: %ld bytes used in %d selected items.
ca: %ld bytes utilitzats en %d elements seleccionats.
cs: %ld bytù v %d vybraných polo¾kách.
pl: %ld bajty/ów u¿yte przez %d wybrany przedm.
ro: %ld byte utilizaþi în %d de articole selectate.
tr: %ld bayt seçili %d nesne kullanýyor.

source: FILE INFORMATION
ca: INFORMACIó DE FITXER
cs: INFORMACE O SOUBORU
pl: INFORMACJE O PLIKU
ro: INFO DESPRE FIªIER
tr: DOSYA BÝLGÝSÝ

source: FOLDER INFORMATION
ca: INFORMACIó DE CARPETA
cs: INFORMACE O ODRESÁØI
pl: INFORMACJE O FOLDERZE
ro: INFO DESPRE DOSARE
tr: KLASÖR BÝLGÝSÝ

source: COPY FILE(S)
ca: COPIA FITXER(S)
cs: KOPÍROVAT SOUBOR(Y)
pl: SKOPIUJ PLIK(I)
ro: COPIAÞI FIªIERUL/ELE
tr: DOSYA(LARI) KOPYALA

source: MOVE FILE(S)
ca: MOU FITXER(S)
cs: PØESUNOUT SOUBOR(Y)
pl: PRZENIE¦ PLIK(I)
ro: MUTAÞI FIªIERUL/ELE
tr: DOSYA(LARI) TAÞI

source: DELETE FILE(S)
ca: SUPRIMEIX FITXER(S)
cs: SMAZAT SOUBOR(Y)
pl: USUÑ PLIKI
ro: ªTERGEÞI FIªIERUL/ELE
tr: DOSYA(LARI) SÝL

source: DISK
ca: DISC
pl: DYSK
ro: DISC
tr: SÜRÜCÜ

source: TRASH
ca: PAPERERA
cs: KO©
pl: KOSZ
ro: COª DE GUNOI
tr: ÇÖP KUTUSU

source: PRINTER
ca: IMPRESSORA
cs: TISKÁRNA
pl: DRUKARKA
ro: IMPRIMANTÃ
tr: YAZICI

source: -More-
ca: -Més-
cs: -Pokraèování-
pl: -Wiêcej-
ro: -Mai mult-
tr: -Daha-

source: -End of file-
ca: -Final de fitxer-
cs: -Konec souboru-
pl: -Koniec-
ro: -Sfârºit de fiºier-
tr: -Dosya sonu-

source: -File read error-
ca: -Error de lectura de fitxer-
cs: -Chyba ètení souboru-
pl: -B³±d odczytu pliku-
ro: -Eroare de citire fiºier-
tr: -Dosya okuma hatasý-

source: Locate item
ca: Localitza element
cs: Vyhledat polo¾ku
pl: Znajd¼ przedmiot
ro: Localizaþi articolul
tr: Nesneyi bulun

source: Select .INF file
ca: Selecciona fitxer .INF
cs: Vyberte .INF soubor
pl: Wybierz plik .INF
ro: Selectaþi un fiºier .INF
tr: .INF dosyasý seçin

source: [2][Switch resolution?][ Yes | No ]
ca: [2][Canvia resolució?][ Sí | No ]
cs: [2][Zmìnit rozli¹ení?][ Ano | Ne ]
pl: [2][Zmieniæ rozdzielczo¶æ?][ Tak | Nie ]
ro: [2][Schimbaþi rezoluþia?][ Da | Nu ]
tr: [2][Çözünürlüðü deðiþtir?][ Evet | Hayýr ]

source: [2][Show or print this document?][Show|Print|Cancel]
ca: [2][Mostra o imprimeix|aquest document?][Mostra|Imprimeix|Cancel·la]
cs: [2][Zobrazit nebo vytisknout|tento dokument?][Zobrazit|Vytisknout|Zru¹it]
pl: [2][Pokazaæ czy wydrukowaæ ten|dokument?][Poka¿|Wydrukuj|Anuluj]
ro: [2][Afiºaþi sau imprimaþi|acest document?][Afiºaþi|Imprimaþi|Anulaþi]
tr: [2][Belgeyi göster veya yazdýr?][Görüntüle|Yazdýr|Ýptal]

source: [1][Print error!][ Retry | Cancel ]
ca: [1][Error d'impressió!][Reintenta|Cancel·la]
cs: [1][Chyba tisku!][ Opakovat | Zru¹it ]
pl: [1][B³±d druku!][Ponów|Anuluj]
ro: [1][Eroare de imprimare!][Reîncercaþi|Anulaþi]
tr: [1][Yazdýrma hatasý!][ Tekrar | Ýptal ]

source: [1][This document type has no|associated application.][ OK ]
ca: [1][Aquest tipus de document no|té cap aplicació associada.][D'acord]
cs: [1][Tento typ dokumentu nemá|asociovanou aplikaci.][ OK ]
pl: [1][Ten typ dokumentu nie ma|powi±zanego programu.][ OK ]
ro: [1][Acest tip de document nu are|o aplicaþie asociatã.][ OK ]
tr: [1][Bu belge bir uygulamayla|iliþkilendirilmemiþ.][ Tamam ]

source: [1][The GEM Desktop has no more|windows. Please close a|window that you are not|using.][ OK ]
ca: [1][L'Escriptori GEM no té més|finestres. Tanca una|finestra que no fes servir.][D'acord]
cs: [1][GEM desktop nemá více oken.|Prosím zavøete okno,|co nepou¾íváte.][ OK ]
pl: [1][Pulpit GEM nie ma wiêcej|okien. Proszê zamkn±æ okno,|którego ju¿ nie u¿ywasz.][ OK ]
ro: [1][Biroul GEM nu mai are|ferestre. Închideþi o|fereastrã pe care nu|o utilizaþi.][ OK ]
tr: [1][GEM Masaüstünde daha fazla|pencere yok. Lütfen|kullanmadýðýnýz bir pencereyi|kapatýn.][ Tamam ]

source: [1][Illegal directory operation!][ Skip | Abort ]
ca: [1][Operació de directori il·legal!][ Salta | Atura ]
cs: [1][Neplatná adresáøová operace!][Pøeskoèit| Zru¹it ]
pl: [1][Niedozwolona operacja katalogu!][Pomiñ|Przerwij]
ro: [1][Operaþiune ilegalã|în directoare!][Sãriþi|Anulaþi]
tr: [1][Geçersiz dizin iþlemi!][ Atla | Ýptal ]

source: [1][Illegal operation!][ OK ]
ca: [1][Operació il·legal!][D'acord]
cs: [1][Neplatná operace!][ OK ]
pl: [1][Niedozwolona operacja!][ OK ]
ro: [1][Operaþiune ilegalã!][ OK ]
tr: [1][Geçersiz iþlem!][ Tamam ]

source: [2][Abort this operation?][ Yes | No ]
ca: [2][Aturar aquesta operació?][ Sí | No ]
cs: [2][Pøeru¹it operaci?][ Ano | Ne ]
pl: [2][Przerwaæ t± operacjê?][ Tak | Nie ]
ro: [2][Anulaþi aceastã operaþiune?][ Da | Nu ]
tr: [2][Ýþlem iptal edilsin mi?][ Evet | Hayýr ]

source: [2][Do you want to delete all|the files on drive %c: ?][Yes| No ]
ca: [2][Suprimir tots els fitxers|d'unitat %c:?][ Sí | No ]
cs: [2][Opravdu chcete smazat|v¹echny soubory na disku %c: ?][Ano| Ne ]
pl: [2][Czy chcesz usun±æ wszystkie|pliki na dysku %c:?][ Tak | Nie ]
ro: [2][Doriþi sã ºtergeþi toate|fiºierele de pe unitatea %c:?][ Da | Nu ]
tr: [2][%c sürücüsündeki tüm dosyalarý|silmek istiyor musunuz?][ Evet | Hayýr ]

source: [1][Sorry, the desktop cannot|install any more icons|or applications.][ OK ]
ca: [1][Perdó, l'escriptori no pot|instal·lar més icones|o aplicacions.][D'acord]
cs: [1][Na plochu nelze|nainstalovat více ikon|nebo aplikací.][ OK ]
pl: [1][Niestety, pulpit nie mo¿e|doda¿ wiêcej ikon lub|programów.][ OK ]
ro: [1][Pe birou nu se mai pot|instala icoane sau aplicaþii.][ OK ]
tr: [1][Üzgünüm, masaüstüne daha|fazla simge veya uygulama|kurulamaz.][ Tamam ]

source: [2][You cannot create a folder|with that name. Please retry|with a new name, or cancel.][Cancel|Retry]
ca: [2][No puda crear una carpeta|amb aquest nom. Reintenta|amb nom nou o cancel·la.][Cancel·la|Reintenta]
cs: [2][Nelze vytvoøit adresáø|s tímto jménem. Prosím zadejte|jiné jméno, nebo zru¹te.][Zru¹it|Opakovat]
pl: [2][Nie mo¿esz utworzyæ folderu|z t± nazw±. Spróbuj ponownie|z now± nazw± lub anuluj.][Anuluj|Ponów]
ro: [2][Nu puteþi crea un dosar cu|acest nume. Reîncercaþi cu un|nume mou sau anulaþi.][Anulaþi|Reîncercaþi]
tr: [2][Bu isimle bir klasör|oluþturamazsýnýz. Lütfen|yeni bir isimle deneyin|veya iptal edin.][Ýptal|Tekrar]

source: [1][Drive %c: does not have|enough room for this|operation.][ OK ]
ca: [1][Unitat %c: no té prou|espai per a aquesta|operació.][D'acord]
cs: [1][Na disku %c: není dost místa|pro tuto operaci.][ OK ]
pl: [1][Dysk %c: nie ma wyst.|du¿o miejsca na t±|operacjê.][ OK ]
ro: [1][Unitatea %c: nu are spaþiu|suficient pentru aceastã|operaþiune.][ OK ]
tr: [1][%c sürücüsünde bu iþlem|için yeterli yer yok.][ Tamam ]

source: [3][You cannot create or|access a folder this far|down the directory path.][ OK ]
ca: [3][No pots crear ni accedir|a una carpeta tan lluny|del camí del directori.][D'acord]
cs: [3][Nelze vytváøet èi pøistupovat|k adresáøùm takto hluboko|v adresáøové cestì.][ OK ]
pl: [3][Nie mo¿esz stworzyæ lub|mieæ dostêpu do folderu|tak daleko w ¶cie¿ce katalogu.][ OK ]
ro: [3][Nu puteþi sã creaþi sau sã|accesaþi un dosar atât de|departe în calea directoarelor.][ OK ]
tr: [3][Bu kadar derin dizin yolunda|klasör oluþturaz veya|eriþemezsiniz.][ Tamam ]

source: [3][You cannot create or access|a file or folder with that|name, because the pathname|is too long.][ OK ]
ca: [3][No pots crear ni accedir|a un fitxer o carpeta amb|aquest nom, perquè el nom|de camí és massa llarg.][D'acord]
cs: [3][Nelze vytváøet èi pøistupovat|k souborùm èi adresáøùm s tímto|jménem, proto¾e cesta souboru|je pøíli¹ dlouhá.][ OK ]
pl: [3][Nie mo¿esz stworzyæ lub|mieæ dostêpu do pliku lub|folderu z t± nazw±, poniewa¿|nazwa ¶cie¿ki jest zbyt d³uga.][ OK ]
ro: [3][Nu puteþi sã creaþi sau sã|accesaþi un fiºier sau un dosar|cu achest nume, deoarece numele|cãii de access este prea lung.][ OK ]
tr: [3][Bu isimde bir dosya veya|klasör oluþturamazsýnýz veya.|eriþemezsiniz çünkü|yolu çok uzun.][ Tamam ]

source: [1][%s is used to|permanently delete files|or folders.][ OK ]
ca: [1][%s s'utilitza per suprimir|fitxers o carpetes|permanentment.][D'acord]
cs: [1][%s se pou¾ívá pro|trvalé smazání souborù|nebo adresáøù.][ OK ]
pl: [1][%s jest u¿ywane, by|trwale usuwaæ pliki|lub foldery.][ OK ]
ro: [1][%s este utilizat pentru a|ºterge definitiv fiºiere|sau dosare.][ OK ]
tr: [1][Kalýcý olarak dosyalarý|ve klasörleri silmek için %s|kullanýldý.][ Tamam ]

source: [1][%s|is a printer.][ OK ]
ca: [1][%s|és una impressora.][D'acord]
cs: [1][%s|je tiskárna.][ OK ]
pl: [1][%s|jest drukark±.][ OK ]
ro: [1][%s|este o imprimantã.][ OK ]
tr: [1][%s|bir yazýcýdýr.][ Tamam ]

source: [1][You cannot drag applications,|files or folders onto the|Desktop.][ OK ]
ca: [1][No pots arrossegar aplicacions,|fitxers o carpetes|a l'Escriptori.][D'acord]
cs: [1][Na plochu nelze pøetáhnout,|soubory nebo adresáøe.][ OK ]
pl: [1][Nie mo¿esz przeci±gaæ|programów, plików lub|folder na pulpit.][ OK ]
ro: [1][Nu puteþi sã glisaþi aplicaþii,|fiºiere sau dosare pe birou.][ OK ]
tr: [1][Uygulamalarý, dosyalarý ve|klasörler masaüstüne sürükleyip|býrakamazsýnýz.][ Tamam ]

source: [2][Save Desktop?][ OK |Cancel]
ca: [2][Desa l'Escriptori?][D'acord|Cancel·la]
cs: [2][Ulo¾it stav desktopu?][ OK |Zru¹it]
pl: [2][Zapisaæ pulpit?][ OK |Anuluj]
ro: [2][Salvare birou?][ OK |Anulaþi]
tr: [2][Masaüstü kaydedilsin mi?][ Tamam |Ýptal]

source: [2][Do you want to remove icons|or delete files?][Icons|Files|Cancel]
ca: [2][Elimina icones o|suprimi fitxers?][Icones|Fitxers|Cancel·la]
cs: [2][Chcete odstranit ikony|nebo smazat soubory?][Ikony|Soubory|Zru¹it]
pl: [2][Chcesz usun±æ ikony czy pliki?][Ikony|Pliki|Anuluj]
ro: [2][Doriþi sã eliminaþi icoane sau|sã ºtergeþi fiºiere?][Icoane|Fiºiere|Anulaþi]
tr: [2][Simge kaldýrmak veya|dosyalarý sil?][Simgeler|Dosyalar|Ýptal]

source: [1][Invalid function key value.][ OK ]
ca: [1][Valor de tecla de funció|no vàlid.][D'acord]
cs: [1][Neplatná hodnota|funkèní klávesy.][ OK ]
pl: [1][Niew³a¶ciwa warto¶æ klawisza|funkcji.][ OK ]
ro: [1][Valoare invalidã a tastei|de funcþie.][ OK ]
tr: [1][Geçersiz fonksiyon tuþu deðeri.][Tamam]

source: [2][Function key already assigned.|Do you want to reassign it?][ OK |Cancel]
ca: [2][Tecla de funció ja assignada.|Reassignar-la?][D'acord|Cancel·la]
cs: [2][Funkèní klávesa je obsazena.|Chcete ji zmìnit?][ OK |Zru¹it]
pl: [2][Klawisz funkcji ju¿|przydzielony. Chcesz go|znów przydzieliæ?][ OK |Anuluj]
ro: [2][Tastã de funcþie deja atribuitã.|Doriþi sã o realocaþi?][ OK |Anulaþi]
tr: [2][Fonksiyon tuþu zaten atanmýþ.|Yeniden atamak istiyor musunuz?][Tamam|Ýptal]

source: [3][Not enough memory to|initialise EmuDesk.|You must reboot.][ OK ]
ca: [3][No hi ha prou memòria per|inicialitzar EmuDesk.|Heu de reiniciar.][D'acord]
cs: [3][Nedostatek pamìti|k inicializaci EmuDesku.|Nutno restartovat.][ OK ]
pl: [3][Brak pamiêci, by|uruchomiæ EmuDesk.|Musisz zrestartowaæ.][ OK ]
ro: [3][Nu este suficientã memorie|pentru a iniþializa EmuDesk.|Trebuie sã reporniþi.][ OK ]
tr: [3][Emudesk'i baþlatmak için|yeterli hafýza yok.|Yeniden baþlatmalýsýnýz.][Tamam]

source: [2][%s not found.|Do you want to remove the|icon or locate the item?][Remove|Locate|Cancel]
ca: [2][%s no s'ha trobat.|Elimina l'icona o|localitza l'element?][Elimina|Localitza|Cancel·la]
cs: [2][%s nebyl nalezen.|Chcete odstranit ikonu|nebo vyhledat polo¾ku?][Odstranit|Vyhledat|Zru¹it]
pl: [2][Nie znaleziono %s.|Chcesz usun±æ ikonê,|czy znale¼æ plik?][ Usuñ |Znajd¼|Anuluj]
ro: [2][%s nu a fost gãsit.|Doriþi sã eliminaþi icoana|sau sã localizaþi elementul?][Eliminaþi|Localizaþi|Anulaþi]
tr: [2][%s bulunamadý.|Simge kaldýr veya yerini|bul?][Kaldýr|Bul|Ýptal]

source: [1][Please select icon type.][Desktop|Window|Cancel]
ca: [1][Selecciona tipus d'icona.][Escriptori|Finestra|Cancel·la]
cs: [1][Prosím vyberte typ ikony.][Plocha|Okno|Zru¹it]
pl: [1][Proszê wybraæ typ ikony.][Pulpit| Okno |Anuluj]
ro: [1][Selectaþi tipul de icoana.][Birou|Fereastra|Anulaþi]
tr: [2][Lütfen simge türü seçin.][Masaüstü|Pencere|Ýptal]

source: [1][No matching file type.][ OK ]
ca: [1][No hi ha cap coincident|tipus de fitxer.][D'acord]
cs: [1][Nesouhlasí typ souboru.][ OK ]
pl: [1][Brak pasuj±cego typu plików.][ OK ]
ro: [1][Nu existã un tip de|fiºier corespunzãtor.][ OK ]
tr: [1][Eþleþen Dosya türü yok.][ Tamam ]

source: [3][Formatting error. The target|disk may be write-protected|or unusable.][ Retry | Abort ]
ca: [3][Error de format. El disc|del destinació pot estar|protegit contra escriptura|o inutilitzable.][Reintenta| Atura ]
cs: [3][Chyba pøi formátování. Disketa|mù¾e být chránìna proti zápisu|nebo je ji nelze pou¾ít.][ Opakovat | Zru¹it ]
pl: [3][B³±d formatowania. Cel mo¿e|byæ chroniony przed zapisem|lub nie do u¿ycia.][ Ponów |Przerwij]
ro: [3][Eroare de formatare. Este|posibil ca discul þintã sã|fie protejat la scriere sau|inutilizabil.][Reîncercaþi|Anulaþi]
tr: [3][Biçimlendirme hatasý. Hedef|disket yazma-korumalý veya bozuk|olabilir.][ Tekrar | Ýptal ]

source: [1][This disk has %ld bytes|available to the user.][ Continue | Quit ]
ca: [1][Aquest disc té %ld bytes|disponibles per a l'usuari.][Continua| Surt ]
cs: [1][Na disku je k dispozici|%ld u¾ivatelských bytù.][Pokraèovat| Konec ]
pl: [1][Ten dysk ma %ld bajty/ów|dostêpnych dla u¿ytkownika.][Kontynuuj| Wyjd¼ ]
ro: [1][Acest disc are %ld byte la|dispoziþia utilizatorului.][Continuaþi|Ieºiþi]
tr: [1][Bu diskte kullanýlabilir|%ld bayt var..][ Devam | Çýk ]

source: [1][Drive %s: does not exist.][ Cancel ]
ca: [1][Unitat %s: no existeix.][Cancel·la]
cs: [1][Disk %s: neexistuje.][ Zru¹it ]
pl: [1][Stacja %s: nie istnieje.][Anuluj]
ro: [1][Unitatea %s: nu existã.][Anulaþi]
tr: [1][Sürücü %s: mevcut deðil.][ Ýptal ]

source: [1][No drive identifier.][ Retry ]
ca: [1][No hi ha identificador|d'unitat.][Reintenta]
cs: [1][®ádný identifikátor disku.][ Opakovat ]
pl: [1][Brak okre¶lenia stacji.][ Ponów ]
ro: [1][de unitate.][Reîncercaþi]
tr: [1][Sürücü tanýmlayýcý yok.][ Tekrar ]

source: [1][Cannot delete file|%s][ Skip | Retry | Abort ]
ca: [1][No es pot suprimir fitxer|%s][ Salta |Reintenta| Atura ]
cs: [1][Nelze smazat soubor|%s][Pøeskoèit| Opakovat | Zru¹it ]
pl: [1][Nie mo¿na usun±æ pliku|%s][ Pomiñ | Ponów |Przerwij]
ro: [1][Nu se poate ºterge|fiºierul %s][Sãriþi|Reîncercaþi|Anulaþi]
tr: [1][%s dosyasý silinemedi][ Atla | Tekrar | Ýptal ]

source: [1][Cannot delete directory|%s][ Skip | Retry | Abort ]
ca: [1][No es pot suprimir directori|%s][ Salta |Reintenta| Atura ]
cs: [1][Nelze smazat adresáø|%s][Pøeskoèit| Opakovat | Zru¹it ]
pl: [1][Nie mo¿na usun±æ folderu|%s][ Pomiñ | Ponów |Przerwij]
ro: [1][Nu se poate ºterge|directorul %s][Sãriþi|Reîncercaþi|Anulaþi]
tr: [1][%s dizini silinemedi][ Atla | Tekrar | Ýptal ]

source: [1][Not enough memory.][ OK ]
ca: [1][No hi ha prou memòria.][D'acord]
cs: [1][Nedostatek pamìti.][ OK ]
pl: [1][Brak pamiêci.][ OK ]
ro: [1][Nu este suficientã memorie.][ OK ]
tr: [1][Yeterli hafýza yok.][ Tamam ]

source: [1][%s not found.][ OK ]
ca: [1][%s no s'ha trobat.][D'acord]
cs: [1][%s nenalezen.][ OK ]
pl: [1][Nie znaleziono %s.][ OK ]
ro: [1][%s nu a fost gãsit.][ OK ]
tr: [1][%s bulunamadý.][ Tamam ]

source: [1][Cannot open file|%s][ Skip | Retry | Abort ]
ca: [1][No es pot obrir fitxer|%s][ Salta|Reintenta| Atura ]
cs: [1][Nelze otevøít soubor|%s][Pøeskoèit| Opakovat | Zru¹it ]
pl: [1][Nie mo¿na otworzyæ pliku|%s][ Pomiñ | Ponów |Przerwij]
ro: [1][Nu se poate deschide fiºierul|%s][Sãriþi|Reîncercaþi|Anulaþi]
tr: [1][%s dosyasý açýlamadý][ Atla | Tekrar | Ýptal ]

source: [1][Cannot create file|%s][ Skip | Retry | Abort ]
ca: [1][No es pot crear fitxer|%s][ Salta |Reintenta| Atura ]
cs: [1][Nelze vytvoøit soubor|%s][Pøeskoèit| Opakovat | Zru¹it ]
pl: [1][Nie mo¿na stworzyæ pliku|%s][ Pomiñ | Ponów |Przerwij]
ro: [1][Nu se poate crea fiºierul|%s][Sãriþi|Reîncercaþi|Anulaþi]
tr: [1][%s dosyasý oluþturulamadý][ Atla | Tekrar | Ýptal ]

source: [1][Cannot read file|%s][ Skip | Abort ]
ca: [1][No es pot llegir fitxer|%s][ Salta | Atura ]
cs: [1][Nelze èíst soubor|%s][Pøeskoèit| Zru¹it ]
pl: [1][Nie mo¿na przeczytaæ pliku|%s][ Pomiñ |Przerwij]
ro: [1][Nu se poate citi fiºierul|%s][Sãriþi|Anulaþi]
tr: [1][%s dosyasý okunamadý][ Atla | Ýptal ]

source: [1][Cannot write file|%s][ Skip | Abort ]
ca: [1][No es pot escriure fitxer|%s][ Salta | Atura ]
cs: [1][Nelze zapsat soubor|%s][Pøeskoèit| Zru¹it ]
pl: [1][Nie mo¿na wpisaæ do pliku|%s][ Pomiñ |Przerwij]
ro: [1][Nu se poate scrie fiºierul|%s][Sãriþi|Anulaþi]
tr: [1][%s dosyasý yazýlamadý][ Atla | Ýptal ]

source: [1][Rename error!][ Retry | Cancel ]
ca: [1][Error de canvi de nom!][Reintenta|Cancel·la]
cs: [1][Chyba pøejmenování!][ Opakovat | Zru¹it ]
pl: [1][B³±d zmiany nazwy!][Ponów|Anuluj]
ro: [1][Eroare de redenumire!][Reîncercaþi|Anulaþi]
tr: [1][Yeniden adlandýrma hatasý!][ Tekrar | Ýptal ]

source: [1][Failed to set default|directory.][ OK ]
ca: [1][No s'ha pogut establir|directori predeterminat.][D'acord]
cs: [1][Selhalo nastavení|výchozího adresáøe.][ OK ]
pl: [1][Nie uda³o siê ustawiæ|domy¶lnego katalogu.][ OK ]
ro: [1][Nu s-a reuºit sã setaþi|directorul implicit.][ OK ]
tr: [1][Varsayýlan dizin|ayarlanamadý.][ Tamam ]

source: [1][Illegal .INF file format.][ OK ]
ca: [1][Format de fitxer .INF il·legal.][D'acord]
cs: [1][Neplatný formát souboru .INF.][ OK ]
pl: [1][Niedozwolony format pliku .INF.][ OK ]
ro: [1][Format de fiºier .INF ilegal.][ OK ]
tr: [1][Geçersiz.INF dosya formatý.][ Tamam ]

source: [2][Continue to search?][ OK |Cancel]
ca: [2][Continuar cercant?][D'acord|Cancel·la]
cs: [2][Pokraèovat ve hledání?][ OK |Zru¹it]
pl: [2][Wci±¿ szukaæ?][ OK |Anuluj]
ro: [2][Continuaþi sã cãutaþi?][ OK |Anulaþi]
tr: [2][Aramaya devam edilsin mi?][ Tamam |Ýptal]

source: [1][No more files.][ OK ]
ca: [1][No hi ha més fitxers.][D'acord]
cs: [1][®ádne dal¹í soubory.][ OK ]
pl: [1][Nie ma wiêcej plików.][ OK ]
ro: [1][Nu mai existã fiºiere.][ OK ]
tr: [1][Baþka dosya yok.][ Tamam ]

source: [2][Last key is already assigned.|Do you want to reassign it?][ OK |Cancel]
ca: [2][última tecla ja està assignada.|Reassignar-la?][D'acord|Cancel·la]
cs: [2][Klávesa je ji¾ pou¾ita.|Chcete ji zmìnit?][ OK |Zru¹it]
pl: [2][Ostatni klawisz jest ju¿|przypisany. Przypisaæ|jeszcze raz?][ OK |Anuluj]
ro: [2][Ultimã tastã este deja atribuitã.|Doriþi sã o realocaþi?][ OK |Anulaþi]
tr: [2][Son tuþ zaten atanmýþ.|Yeniden atamak istiyor musunuz?][ Tamam |Ýptal]

source: Copy <filespec> ... to standard output
ca: Copia <especfitx> ... a sortida estàndard
pl: Kopiuj <filespec> ... do standardowego wyj¶cia
ro: Copier <filespec> ... vers la sortie standard
tr: <filespec>'ný standart çýktýya kopyala

source: Change current directory to <dir>
ca: Canvia directori actual a <dir>
pl: Zmieñ aktualny katalog do <katalog>
ro: Changer le rï¿½pertoire courant vers <dir>
tr: Geçerli dizini <dir> olarak deðiþtir

source: or display current directory
ca: o mostra directori actual
pl: lub wy¶wietl aktualny katalog
ro: ou afficher le rï¿½pertoire courant
tr: veya mevcut dizini gösterir

source: Change attributes for <filename>
ca: Canvia atributs de <nomedelfitxer>
pl: Zmieñ atrybuty dla <nazwapliku>
ro: Changer les attributs de <filename>
tr: <filename>'nin niteliklerini deðiþtir

source: <mode> specifies the new attribute(s):
ca: <mode> especifica nou(s) atribut(s)
pl: <tryb> okre¶la nowy/e atrybut(y)
ro: <mode> spï¿½cifie les nouveaux attributs:
tr: <mode> yeni öznitelikleri belirle:

source: r=read-only h=hidden s=system -=none
ca: r=només lectura h=ocult s=sistema -=cap
pl: r=tylko do odczytu h=ukryty s=systemowy -=brak
ro: r=lecture seule h=cachï¿½ s=systï¿½me -=aucun
tr: r=salt-okunur h=gizli s=sistem -=yok

source: Clear screen
ca: Esborra pantalla
pl: Wyczy¶æ ekran
ro: Effacer l'ï¿½cran
tr: Ekraný temizle

source: Copy files matching <filespec> to <dest>
ca: Copia fitxers que coincideixin amb <especfitx> a <dest>
pl: Kopiuj pliki pasuj±ce do <filespec> do <cel>
ro: Copier les fichiers correspondant ï¿½ <filespec> vers <dest>
tr: <filespec> ile eþleþen dosyalarý <dest> konumuna kopyala

source: If <filespec> matches multiple files,
ca: Si <especfitx> coincideixin amb diversos fitxers,
pl: Je¶li <filespec> pasuje do wielu plików,
ro: Si <filespec> correspond ï¿½ plusieurs fichiers,
tr: <filespec> birkaç dosyayý tanýmlýyorsa,

source: <dest> must be a directory
ca: <dest> ha de ser un directori
pl: <cel> musi byæ katalogiem
ro: <dest> doit ï¿½tre un rï¿½pertoire
tr: <dest> bir dizin olmalýdýr

source: Copy <string> ... to standard output
ca: Copia <cadena> ... a sortida estàndard
pl: Kopiuj <ci±g-znaków> ... do standartowego wyj¶cia
ro: Copier <string> ... vers la sortie standard
tr: <string>'yi standart çýktýya kopyala

source: Strings may be surrounded by ""
ca: Cadenes poden estar envoltades de ""
pl: Ci±gi znaków mog± byæ otoczone przez ""
ro: Les chaines peuvent ï¿½tre mises entre ""
tr: Dizeler "" ile çevrelenmelidir

source: Exit EmuCON2
ca: Surt EmuCON2
pl: Opu¶æ EmuCON2
ro: Quitter EmuCON2
tr: EmuCON2'den çýk
