Repository: emutos/emutos
Catalog: po/*.po
Languages: ca, cs, pl, ro, tr

source: Memory test
ca: Prova de memòria
cs: Test pamìti
pl: Test pamiêci
ro: Test de memorie
tr: Bellek testi

source: complete
ca: completat
cs: dokonèen
pl: ukoñczony
ro: complet
tr: tamam

source: aborted
ca: aturat
cs: zru¹en
pl: przerwany
ro: anulat
tr: kesildi

source: System halted!
ca: Sistema aturat!
cs: Systém zastaven!
pl: Zatrzymano system!
ro: Sistemul s-a oprit!
tr: Sistem durdu!

source: GEMDOS drives
ca: Unitats GEMDOS
cs: Disky GEMDOSu
pl: Dyski GEMDOS
ro: Unitãþi
tr: GEMDOS sürücüleri

source: EmuTOS Version
ca: Versió EmuTOS
cs: EmuTOS verze
pl: Wersja EmuTOS
ro: Versiunea EmuTOS
tr: EmuTOS Sürümü

source: CPU type
ca: Tipus CPU
cs: Typ CPU
pl: Typ CPU
ro: Tip CPU
tr: CPU türü

source: Machine
ca: Màquina
cs: Poèítaè
pl: Komputer
ro: Maºinã
tr: Bilgisayar

source: Boot time
ca: Temps d'arrencada
cs: Èas startu
pl: Czas uruchomienia
ro: Timp de pornire
tr: Önyükleme zamaný

source: Hold <Control> to skip AUTO/ACC
ca: Sostén <Ctrl> per ometre AUTO/ACC
cs: Podr¾ <Ctrl> a pøeskoè AUTO/ACC
pl: Przytrzymaj Ctrl, by pomin±æ auto-boot
ro: <Ctrl> pentru a sãri peste AUTO/ACC
tr: <Kontrol> basarsanýz AUTO/ACC atlar

source: Hold <Alternate> to skip HDD boot
ca: Sostén <Alt> per ometre arrencada disc dur
cs: Podr¾ <Alt> k pøeskoèení HDD
pl: Przytrzymaj Alt, by pomin±æ start z HDD
ro: <Alt> pentru a sãri peste pornirea HDD
tr: <Alternate> basarsanýz HDD boot atlar

source: Press key 'X' to boot from X:
ca: 'X' per arrencar des X:
cs: Pro start z disku X: stisknìte klávesu 'X'.
pl: Wci¶nij X, by uruchomiæ z X:
ro: 'X' pentru a porni de la X:
tr: X: den önyükleme için 'X' tuþuna basýn

source: Press <Esc> to run an early console
ca: <Esc> per executar una consola
cs: Pro spu¹tìní brzké konzole stisknìte <Esc>.
pl: Wci¶nij Esc, by w³±czyæ terminal
ro: <Esc> pentru a executa o consolã
tr: Erken konsol için <Esc> tuþuna basýn

source: Hold <Shift> to pause this screen
ca: <Shift> per pausar aquesta pantalla
cs: Podr¾ <Shift> pro pauzu obrazovky
pl: Przytrzymaj Shift by zatrzymaæ ten ekran
ro: <Shift> pentru a întrerupe acest ecran
tr: Duraklatmak için <Shift> tuþuna basýn

source: *** Press any key to continue ***
ca: * Premeu qualsevol tecla per continuar *
cs: *** Pokraèování libovolnou klávesou ***
pl: *** Wci¶nij dowolny klawisz, by kontynuowaæ
ro: * Apãsaþi orice tastã pentru a continua *
tr: *** Devam etmek için bir tuþa basýn ***

source: 033EOut of internal memory. Use FOLDR100.PRG to get more. System halted!
ca: 033ESense memòria interna. Utilitzeu FOLDR100.PRG per obtenir més. Sistema aturat!
cs: 033ENedostatek vnitøní pamìti. Uvolnìte její èást s FOLDR100.PRG Systém zastaven!
pl: 033EBrak dostêpnej pamiêci. U¿yj FOLDR100.PRG, by uzyskaæ wiêcej. Zatrzymano system!
ro: 033ENu mai aveþi memorie internã. Utilizaþi FOLDR100.PRG pentru a obþine mai mult. Sistemul s-a oprit!
tr: 033E Dahili bellek tükendi. Daha fazlasý için FOLDR100.PRG kullanýn. Sistem durdu!

source: Selection: ________.___
ca: Selecció: ________.___
cs: Výbìr: ________.___
pl: Wybór: ________.___
ro: Selecþie: ________.___
tr: Seçim: ________.___

source: Directory:
ca: Directori:
cs: Adresáø:
pl: Katalog:
ro: Director:
tr: Dizin:

source: Drive:
ca: Unitat:
cs: Jednotka:
pl: Dysk:
ro: Unitate:
tr: Sürücü:

source: OK
ca: D'acord
tr: Tamam

source: Cancel
ca: Cancel·la
cs: Zru¹it
pl: Anuluj
ro: Anulaþi
tr: iptal

source: [1][The disk in drive %c: is|physically write-protected.][Cancel|Retry]
ca: [1][El disc d'unitat %c: està|físicament protegit.][Cancel·la|Reintenta]
cs: [1][Disk v jednotce %c: je|fyzicky chránìn proti zápisu.][Zru¹it|Opakovat]
pl: [1][Dysk w stacji %c: jest|fizycznie chroniony|przed zapisem.][Anuluj|Ponów]
ro: [1][Discul din unitatea %c: este|fizic protejat la scriere.][Anulaþi|Reîncercaþi]
tr: [1][%c diski fiziksel olarak|yazmaya karþý korumalý.][Ýptal|Tekrar]

source: [2][Drive %c: is not responding.|Please check the disk drive,|or insert a disk.][Cancel|Retry]
ca: [2][Unitat %c: no respon. Comproveu|l'unitat de disc o inseriu disc.][Cancel·la|Reintenta]
cs: [2][Jednotka %c: nereaguje.|Prosím zkontrolujte jednotku,|nebo zasuòte disk.][Zru¹it|Opakovat]
pl: [2][Stacja %c: nie odpowiada.|Proszê sprawdziæ stacjê|dyskietek, lub wstawiæ dysk.][Anuluj|Ponów]
ro: [2][Unitatea %c: nu rãspunde.|Verificaþi unitatea de discuri|sau introduceþi un disc.]
tr: [2][Sürücü %c: yanýt vermiyor.|Lütfen ortamý kontrol edin veya|doðru þekilde yerleþtirin][Ýptal|Tekrar]

source: [1][Data on the disk in drive %c:|may be damaged.][Cancel|Retry]
ca: [1][Dades de disc d'unitat %c:|poden estar danyades.][Cancel·la|Reintenta]
cs: [1][Data na disku v jednotce %c:|mohou být po¹kozena.][Zru¹it|Opakovat]
pl: [1][Dane na dysku w stacji %c:|mog± by popsute.][Anuluj|Ponów]
ro: [1][Este posibil ca datele de pe|fie deteriorate.][Anulaþi|Reîncercaþi]
tr: [1][%c sürücüsündeki veriler bozuk | olabilir.][Ýptal|Tekrar]

source: [2][This application cannot read|data on the disk in drive %c:.][Cancel|Retry]
ca: [2][Aquesta aplicació no pot llegir|dades al disc d'unitat %c:.][Cancel·la|Reintenta]
cs: [2][Aplikace nemù¾e pøeèíst|data na disku v jednotce %c:.][Zru¹it|Opakovat]
pl: [2][Ten program nie mo¿e przeczytaæ|danych na dysku w stacji %c:.][Anuluj|Ponów]
ro: [2][Aceastã aplicaþie nu poate|citi datele de pe discul din|unitatea %c:.][Anulaþi|Reîncercaþi]
tr: [2][Bu uygulama %c sürücüsünden|sürücüsünden veri okuyamýyor.][Ýptal|Tekrar]

source: [1][Your output device is not|receiving data.][Cancel|Retry]
ca: [1][Teu dispositiu de sortida|no rep dades.][Cancel·la|Reintenta]
cs: [1][Výstupní zaøízení|nepøijímá data.][Zru¹it|Opakovat]
pl: [1][Twoje urz±dzenie wyj¶cia nie|otrzymuje danych.][Anuluj|Ponów]
ro: [1][Dispozitivul de ieºire nu|primeºte date.][Anulaþi|Reîncercaþi]
tr: [1][Çýktý cihazýnýz veri|almýyor.][Ýptal|Tekrar]

source: [3][An error has occurred in GEM.|Please contact the EmuTOS|Development Team.][Cancel]
ca: [3][S'ha produït un error a GEM.|Contacta amb l'equip de|desenvolupament d'EmuTOS.][Cancel·la]
cs: [3][Nastala chyba GEM.|Prosím kontaktujte|vývojový tým EmuTOS.][Zru¹it]
pl: [3][Wyst±pi³ b³±d w GEM.|Proszê skontaktowaæ siê z|deweloperami EmuTOS.][Anuluj]
ro: [3][A apãrut o eroare în GEM.|Vã rugãm sã contactaþi echipa|de dezvoltare EmuTOS.][Anulaþi]
tr: [3][GEM'de bir hata oluþtu.|Lütfen EmuTOS ekibiyle iletiþime|geçin.][Ýptal]

source: [2][This application cannot|find the folder or file|you just tried to access.][ OK ]
ca: [2][Aquesta aplicació no pot|trobar la carpeta o fitxer|a qual acabes d'intentar|accedir.][D'acord]
cs: [2][Aplikace nemù¾e najít|adresáø nebo soubor,|na který se sna¾í pøistoupit.][ OK ]
pl: [2][Ten program nie mo¿e|znale¼æ folderu lub pliku,|którego próbowa³e¶ u¿yæ.][ OK ]
ro: [2][Aceastã aplicaþie nu poate gãsi|dosarul sau fiºierul pe care tocmai|aþi încercat sã îl accesaþi.][ OK ]
tr: [1][Uygulama eriþilecek|klasörü veya dosyayý|bulamýyor.][ Tamam ]

source: [1][This application does not|have room to open another|document. To make room,|close any document that|you do not need.][ OK ]
ca: [1][Aquesta aplicació no té espai|per obrir altre document. Per|fer espai, tanca qualsevol|document que no necessita.][D'acord]
cs: [1][Aplikace nemá dostatek místa|k otevøení dal¹ího dokumentu.|Pro získání volného místa|zavøete dokument, který|ji¾ nepotøebujete.][ OK ]
pl: [1][Ten program nie ma miejsca,|by otworzyæ nastêpny|dokument. By zrobiæ miejsce,|zamknij nieu¿ywane dokumenty.][ OK ]
ro: [1][Aceastã aplicaþie nu are loc|pentru a deschide un alt|document. Pentru a face loc,|închideþi orice document de|care nu aveþi nevoie.][ OK ]
tr: [1][Bu uygulamanýn baþka bir|belge açmak için yeri yok.|Yer açmak için gereksiz bir|belgeyi kapatýn.][ Tamam ]

source: [1][An item with this name|already exists in the|directory, or this item|is set to Read Only status.][ OK ]
ca: [1][Un element amb aquest nom|ja existeix al directori o|aquest element està configurat|en estat de Només lectura.][D'acord]
cs: [1][Objekt s tímto jménem|ji¾ v adresáøi existuje,|nebo je pouze ke ètení.][ OK ]
pl: [1][Przedmiot z t± nazw± ju¿|istnieje w katalogu,|lub przedmiot jest ustawiony|na status Tylko odczyt.][ OK ]
ro: [1][Un element cu acest nume existã|deja în director sau acest|element este setat la statutul|doar citire.][ OK ]
tr: [1][Bu adda bir kayýt bu dizinde|zaten var veya bu kayýt |yazmaya karþý korumalý][ Tamam ]

source: [1][The drive you specified|does not exist.][Cancel]
ca: [1][L'unitat que heu|especificat no existeix.][Cancel·la]
cs: [1][Jednotka, kterou jste|specifikovali, neexistuje.][Zru¹it]
pl: [1][Dysk, który okre¶lono|nie istnieje.][Anuluj]
ro: [1][Unitatea pe care aþi|specificat-o nu existã.][Anulaþi]
tr: [1][Belirtilen sürücü|mevcut deðil.][Ýptal]

source: [1][There is not enough memory|in your computer for the|application you just tried|to run.][ OK ]
ca: [1][No hi ha prou memòria|a ordinador per a l'aplicació|que acaba d'intentar executar.][D'acord]
cs: [1][Aplikace nemù¾e být spu¹tìna|pro nedostatek volné pamìti.][ OK ]
pl: [1][Nie ma wystarczaj±cej|pamiêci w komputerze dla|programu, który chciano|uruchomiæ.][ OK ]
ro: [1][Nu existã suficientã memorie|în computerul dvs. pentru|aplicaþia pe care tocmai aþi|încercat sã o rulaþi.][ OK ]
tr: [1][Çalýþtýrmak istediðiniz|uygulama için bilgisayarýnýzda|yeterli hafýza .|bulunmuyor.][ Tamam ]

source: [3][TOS error #%u.][Cancel]
ca: [3][Error TOS #%u.][Cancel·la]
cs: [3][Chyba TOS è. #%u.][ Zru¹it ]
pl: [3][B³±d TOS nr %u.][Anuluj]
ro: [3][Eroare TOS #%u.][Anulaþi]
tr: [3][TOS hatasý #%u.][Ýptal]

source: [3][Unsupported AES function #%d.][Cancel]
ca: [3][Funció AES no compatible #%d.][Cancel·la]
cs: [3][Nepodporovaná AES funkce #%d.][Zru¹it]
pl: [3][Niewspierana funkcja AES|nr #%d.][Anuluj]
ro: [3][Funcþie AES nesuportatã #%d.][Anulaþi]
tr: [3][Desteklenmeyen AES fonksiyonu|#%d.][Ýptal]

source: [1][Not enough memory for|this directory][ OK ]
ca: [1][No hi ha prou memòria|per a aquest directori][D'acord]
cs: [1][Nedostatek pamìti pro|tento adresáø][ OK ]
pl: [1][Brak pamiêci dla tego|katalogu.][ OK ]
ro: [1][Nu este suficientã memorie|pentru acest director][ OK ]
tr: [1][Bu dizin için yeterli|hafýze yok][ Tamam ]

source: ITEM SELECTOR
ca: SELECTOR D'ELEMENTS
cs: VÝBÌR POLO®EK
pl: SELEKTOR PRZEDMIOTÓW
ro: SELECTOR DE ARTICOL
tr: SEÇÝM

source: Name: ________.___
ca: Nom: ________.___
cs: Jméno: ________.___
pl: Nazwa: ________.___
ro: Nume: ________.___
tr: Adý: ________.___

source: Number of folders: _____
ca: Nombre de carpetes: _____
cs: Poèet adresáøù: _____
pl: Liczba folderów: _____
ro: Numãrul de dosare: _____
tr: Klasör adedi: _____

source: Number of files: _____
ca: Nombre de fitxers: _____
cs: Poèet souborù: _____
pl: Liczba plików: _____
ro: Numãrul de fiºiere: _____
tr: Dosya adedi: _____

source: Skip
ca: Salta
cs: Pøeskoèit
pl: Pomiñ
ro: Sãriþi
tr: Atla

source: Install
ca: Instal·la
cs: Instalovat
pl: Dodaj
ro: Instalaþi
tr: Yükle

source: Remove
ca: Elimina
cs: Odstranit
pl: Usuñ
ro: Eliminaþi
tr: Kaldýr

source: Yes
ca: Sí
cs: Ano
pl: Tak
ro: Da
tr: Evet

source: No
cs: Ne
pl: Nie
ro: Nu
tr: Hayýr

source: Size: __________
ca: Mida: __________
cs: Velikost: __________
pl: Rozmiar: __________
ro: Mãrime: __________
tr: Boyut: __________

source: Date: __________
ca: Data: __________
cs: Datum: __________
pl: Data: __________
ro: Data: __________
tr: Tarih: __________

source: Time: __:__ __
ca: Hora: __:__ __
cs: Èas: __:__ __
pl: Czas: __:__ __
ro: Timp: __:__ __
tr: Zaman: __:__ __

source: Drive identifier: _
ca: Identif. d'unitat: _
cs: Oznaèení disku: _
pl: Okre¶lenie dysku: _
ro: Identificator: _
tr: Sürücü kimliði: _

source: Disk label: ________.___
ca: Etiqueta de disc:________.___
cs: Jmenovka: ________.___
pl: Etykieta dysku: ________.___
ro: Etichetã disc: ________.___
tr: Sürücü etiketi: ________.___

source: Bytes used: __________
ca: Bytes utilitzats: __________
cs: Obsazeno: __________ B
pl: Bajty u¿yte: __________
ro: Byte utilizaþi: __________
tr: Kullanýlan bayt: __________

source: Bytes available: __________
ca: Bytes disponibiles: __________
cs: Volných: __________ B
pl: Bajty wolne: __________
ro: Byte disponibile: __________
tr: Kalan bayt: __________

source: Identifier: _:
ca: Identificador: _:
cs: Identifikátor: _:
pl: Okre¶lenie: _:
ro: Literã: _:
tr: Tanýmlayýcý: _:

source: Label: ____________
ca: Etiqueta: ____________
cs: Jmenovka: ____________
pl: Etykieta: ____________
ro: Etichetã: ____________
tr: Etiket: ____________

source: Application name: ________.___
ca: Nom d'aplicació: ________.___
cs: Jméno aplikace: ________.___
pl: Nazwa programu: ________.___
ro: Numele aplicaþiei: ________.___
tr: Uygulama Adý: ________.___

source: Arguments: ___________
cs: Argumenty: ___________
pl: Argumenty: ___________
ro: Argumente: ___________
tr: Argümanlar: ___________

source: Document type: ___
ca: Tipus de document: ___
cs: Typ dokumentu: ___
pl: Typ dokumentu: ___
ro: Tipul de document: ___
tr: Döküman türü: ___

source: Install as: F__
ca: Instal·la com: F__
cs: Instalovat jako: F__
pl: Dodaj jako: F__
ro: Instalaþi ca: F__
tr: Olarak yükle: F__

source: Current name: ________.___
ca: Nom actual: ________.___
cs: Souèasné jméno: ________.___
pl: Aktualna nazwa: ________.___
ro: Numele curent: ________.___
tr: Geçerli isim: ________.___

source: Copy's name: ________.___
ca: Nom de còpia: ________.___
cs: Jméno kopie: ________.___
pl: Nazwa kopii: ________.___
ro: Numele copiei: ________.___
tr: Kopyanýn adý: ________.___

source: Key: ^_
ca: Tecla: ^_
cs: Klávesa: ^_
pl: Klawisz: ^_
ro: Tasta: ^_
tr: Anahtar: ^_

source: Free RAM: _____________________
ca: RAM lliure: _____________________
cs: Volná RAM: _____________________
pl: Wolny RAM: _____________________
ro: RAM liber: _____________________
tr: Boþ RAM: _____________________

source: Label: ________.___
ca: Etiqueta: ________.___
cs: Jmenovka: ________.___
pl: Etykieta: ________.___
ro: Nume: ________.___
tr: Etiket: ________.___

source: Desk
ca: Escriptori
pl: Pulpit
ro: Birou
tr: Masa

source: File
ca: Fitxer
cs: Soubor
pl: Plik
ro: Fiºier
tr: Dosya

source: View
ca: Vista
cs: Zobrazit
pl: Widok
ro: Vedere
tr: Görünüm

source: Options
ca: Opcions
cs: Mo¾nosti
pl: Opcje
ro: Opþiuni
tr: Seçenekler

source: Desktop info...
ca: Info d'esciptori...
cs: Info o desktopu...
pl: Info o Pulpicie...
ro: Info despre birou...
tr: Masaüstü bilgisi...

source: Open
ca: Obre
cs: Otevøít
pl: Otwórz
ro: Deschideþi
tr: Aç

source: Info/Rename...
ca: Info/Canvia nom...
cs: Info/Jméno...
pl: Info/Zm. nazwy...
ro: Info/Redenumiþi...
tr: Bilgi/Yeniden Adlandýr...

source: Search...
ca: Cerca...
cs: Hledat...
pl: Szukaj...
ro: Cãutaþi...
tr: Arama...

source: New folder...
ca: Carpeta nova...
cs: Nový adresáø...
pl: Nowy folder...
ro: Dosar nou...
tr: Yeni klasör...

source: Close folder
ca: Tanca carpeta
cs: Zavøít adresáø
pl: Zamknij folder
ro: Închideþi dosarul
tr: Klasörü kapat

source: Close top window
ca: Tanca finestra superior
cs: Zavøít horní okno
pl: Zamknij górne okno
ro: Înch. fereastra de sus
tr: Pencereyi kapat

source: Cycle windows
ca: Cicla finestres
cs: Dal¹í okno
pl: Cykluj okna
ro: Ciclul ferestrelor
tr: Pencereleri deðiþtir

source: Select all items
ca: Selecciona tots elements
cs: Vybrat v¹e
pl: Wybierz wszystkie przedmioty
ro: Selectaþi toate
tr: Her þeyi seçin

source: Set file mask...
ca: Màscara de fitxer...
cs: Nastavit masku...
pl: Ustaw maskê pliku
ro: Setaþi masca de fiºier...
tr: Dosya maskesini ayarla ...

source: Delete...
ca: Suprimeix...
cs: Smazat...
pl: Usuñ...
ro: ªtergeþi...
tr: Sil ...

source: Format floppy...
ca: Formata disquet...
cs: Formátovat disketu...
pl: Form. dyskietkê...
ro: Formataþi discheta...
tr: Disket biçimlendir...

source: Eject floppy
ca: Expulsa disquet
tr: Disketi çýkar

source: Execute EmuCON
ca: Executa EmuCON
cs: Spustit EmuCON
pl: Uruchom EmuCON
ro: Executaþi EmuCON
tr: EmuCON'u çalýþtýr

source: Shutdown
ca: Apaga
cs: Vypnout
pl: Wy³±cz
ro: Opriþi
tr: Kapat

source: Show as icons
ca: Mostra com a icones
cs: Jako ikony
pl: Poka¿ jako ikony
ro: Afiºaþi ca icoane
tr: Simge olarak

source: Show as text
ca: Mostra com a text
cs: Jako text
pl: Poka¿ jako tekst
ro: Afiºaþi ca text
tr: Metin olarak

source: Sort by name
ca: Ordena per nom
cs: Podle jména
pl: Sortuj - nazwa
ro: Sortaþi dupã nume
tr: Ýsme göre sýrala

source: Sort by type
ca: Ordena per tipus
cs: Podle typu
pl: Sortuj - typ
ro: Sortaþi dupã tip
tr: Türe göre sýrala

source: Sort by size
ca: Ordena per mida
cs: Podle velikosti
pl: Sortuj - Rozmiar
ro: Sortaþi dupã mãrime
tr: Boyuta göre sýrala

source: Sort by date
ca: Ordena per data
cs: Podle data
pl: Sortuj - data
ro: Sortaþi dupã datã
tr: Tarihe göre sýrala

source: No sort
ca: No ordena
cs: Netøídìnì
pl: Nie sortuj
ro: Nu sortaþi
tr: Sýralama

source: Size to fit
ca: Adapta mida
cs: Zarovnat na rozmìr
pl: Pasuj±cy rozmiar
ro: Fereastra idealã
tr: Sýðdýr

source: Set background...
ca: Estableix fons...
cs: Nastavit pozadí...
pl: Ustaw t³o...
ro: Setaþi fundalul...
tr: Arka fon belirle...

source: Install icon...
ca: Instal·la icona...
cs: Instalovat ikonu...
pl: Dodaj ikonê...
ro: Instalaþi icoana...
tr: Simge yükle...

source: Install application...
ca: Instal·la aplicació...
cs: Instalovat aplikaci...
pl: Dodaj program...
ro: Instalaþi aplicaþia...
tr: Uygulama kur...

source: Install devices
ca: Instal·la dispositius
cs: Instalovat zaøízení
pl: Dodaj urz±dzenia
ro: Instalaþi dispozitive
tr: Cihaz kur

source: Remove desktop icon
ca: Elimina icona d'escriptori
cs: Odstranit ikonu z plochy
pl: Usuñ ikonê
ro: Eliminaþi icoana de pe birou
tr: Masaüstü simgesini kaldýr

source: Set preferences...
ca: Estableix preferències...
cs: Nastavení...
pl: Ustawienia...
ro: Setaþi preferinþele...
tr: Tercihler...

source: Desktop configuration...
ca: Configuració d'escriptori...
cs: Konfigurace desktopu...
pl: Konfig. pulpitu
ro: Configuraþie de birou...
tr: Masaüstünü ayarla...

source: Change resolution...
ca: Canvia resolució...
cs: Zmìnit rozli¹ení...
pl: Zmieñ rozdzielo¶æ...
ro: Schimbaþi rezoluþia...
tr: Çözünürlüðü deðiþtir...

source: Read .INF file...
ca: Llegeix fitxer .INF...
cs: Naèíst .INF soubor...
pl: Przeczytaj plik .INF...
ro: Citiþi fiºierul .INF...
tr: .INF dosyasýný okuyun...

source: Save desktop...
ca: Desa escriptori...
cs: Ulo¾it desktop...
pl: Zapisz pulpit...
ro: Salvare birou...
tr: Masaüstünü kaydet...

source: Cache
ca: Memòria cau
tr: Önbellek

source: Read/Write
ca: Lectura/escriptura
cs: Ètení/zápis
pl: Odczyt/Zapis
ro: Citire/scriere
tr: Okuma/Yazma

source: Read-Only
ca: Numés lectura
cs: Jen ètení
pl: Tylko odczyt
ro: Doar citire
tr: Salt-Okunur

source: DISK INFORMATION
ca: INFORMACIó DE DISC
cs: INFORMACE O DISKU
pl: INFORMACJE O DYSKU
ro: INFORMAÞII DESPRE DISC
tr: SÜRÜCÜ BÝLGÝSÝ

source: Version
ca: Versió
cs: Verze
pl: Wersja
ro: Versiunea
tr: Sürüm

source: Copyright 275 2001-
ca: Copyright © 2001-
cs: Copyright (C) 2001-
pl: Pr. aut. (C) 2001-
ro: Copyright (c) 2001-
tr: Telif hakký © 2001-

source: The EmuTOS development team
ca: L'equip de desenvolupament d'EmuTOS
cs: Vývojový tým EmuTOSu
pl: Deweloperzy EmuTOS
ro: Echipa de dezvoltare EmuTOS
tr: EmuTOS geliþtirme ekibi

source: Based on 'GPLed' sources
ca: Basat en fonts de GPLades
cs: Zalo¾eno na 'GPL' zdrojích
pl: Bazowane na 'zGPLowanych' ¼ród³ach
ro: Bazat pe surse GPLate
tr: GPL'leþmiþ kaynaklara dayalý

source: 275 1987 Digital Research, Inc.
ca: © 1987 Digital Research, Inc.
cs: (C) 1987 Digital Research, Inc.
pl: (C) 1987 Digital Research, Inc.
ro: (c) 1987 Digital Research, Inc.
tr: © 1987 Digital Research, Inc.

source: 275 1999 Caldera Thin Clients, Inc.
ca: © 1999 Caldera Thin Clients, Inc.
cs: (C) 1999 Caldera Thin Clients, Inc.
pl: (C) 1999 Caldera Thin Clients, Inc.
ro: (c) 1999 Caldera Thin Clients, Inc.
tr: © 1999 Caldera Thin Clients, Inc.

source: 275 2001 Lineo, Inc.
ca: © 2001 Lineo, Inc.
cs: (C) 2001 Lineo, Inc.
pl: (C) 2001 Lineo, Inc.
ro: (c) 2001 Lineo, Inc.
tr: © 2001 Lineo, Inc.

source: EmuTOS is distributed under the GPL
ca: EmuTOS es distribueix sota la GPL
cs: EmuTOS je ¹íøen pod licencí GPL
pl: EmuTOS jest dystrybutowany po GPL
ro: EmuTOS este distribuit sub GPL
tr: EmuTOS GPL lisansýyla daðýtýlmaktadýr

source: See doc\license.txt for details
ca: doc\license.txt per més informació
cs: Detaily viz doc\license.txt
pl: Zobacz doc\license.txt po info
ro: (doc\license.txt pentru detalii)
tr: Ayrýntý için doc\license.txt bakýn

source: OPEN APPLICATION
ca: OBRE APLICACIó
cs: SPUSTIT APLIKACI
pl: OTWÓRZ PROGRAM
ro: DESCHIDEÞI APLICAÞIA
tr: UYGULAMA AÇ

source: Parameters:
ca: Paràmetres:
cs: Parametry:
pl: Parametry:
ro: Parametrii:
tr: Parametreler:

source: INSTALL DESKTOP ICON
ca: INSTAL·LA ICONA D'ESCRIPTORI
cs: INSTALOVAT IKONU NA PLOCHU
pl: DODAJ IKONÊ
ro: INSTALAÞI ICOANA BIROU
tr: MASAÜSTÜ SÝMGESÝ KUR

source: Item type:
ca: Tipus d'element:
cs: Typ polo¾ky:
pl: Typ przedmiotu:
ro: Tipul de articol:
tr: Nesne türü:

source: Drive
ca: Unitat
cs: Jednotka
pl: St. dysk.
ro: Unitate
tr: Sürücü

source: Trash can
ca: Paperera
cs: Popelnice
pl: Kosz
ro: Coº de gunoi
tr: Çöp Kutusu

source: Printer
ca: Impressora
cs: Tiskárna
pl: Drukarka
ro: Imprimantã
tr: Yazýcý

source: Icon:
ca: Icona:
cs: Ikona:
pl: Ikona:
ro: Icoana:
tr: Simge:

source: INSTALL APPLICATION
ca: INSTAL·LA APLICACIó
cs: INSTALOVAT APLIKACI
pl: DODAJ PROGRAM
ro: INSTALAÞI APLICAÞIA
tr: UYGULAMA KUR

source: Boot status:
ca: Estat d'arrenc.:
pl: Status startu:
ro: Starea de pornire:
tr: Önyükleme:

source: Auto
tr: Otomatik

source: Application type:
ca: Tipus d'aplicació:
cs: Typ aplikace:
pl: Typ programu:
ro: Tipul de aplicaþie:
tr: Uygulama türü:

source: Default dir:
ca: Dir predeterm.:
cs: Adresáø:
pl: Katalog:
ro: Dir implicit:
tr: Vars. dizin:

source: Application
ca: Aplicació
cs: Aplikace
pl: Program
ro: Aplicaþia
tr: Uygulama

source: Window
ca: Finestra
cs: Okno
pl: Okno
ro: Fereastra
tr: Pencere

source: Parameter:
ca: Paràmetre:
cs: Parametr:
pl: Parametr:
ro: Parametru:
tr: Parametre:

source: Full path
ca: Camí compl.
cs: Plná cesta
pl: Pe³. ¶cie¿.
ro: Calea
tr: Tam yol

source: File name
ca: Nom fitxer
cs: Jen jméno
pl: Nazwa pl.
ro: Nume
tr: Dosya adý

source: NAME CONFLICT DURING COPY
ca: CONFLICTE DE NOM DURANT CòPIA
cs: KONFLIKT JMEN BÌHEM KOPÍROVÁNÍ
pl: KONFLIKT NAZW PODCZAS KOPIOWANIA
ro: CONFLICT DE NUME ÎN TIMPUL COPIERII
tr: KOPYALAMA SIRASINDA ÝSÝM ÇATIÞMASI

source: Stop
ca: Atura
cs: Zastavit
tr: Dur

source: NEW FOLDER
ca: CARPETA NOVA
cs: NOVÝ ADRESÁØ
pl: NOWY FOLDER
ro: DOSAR NOU
tr: YENÝ KLASÖR

source: SEARCH FILE
ca: CERCA FITXER
cs: HLEDAT SOUBOR
pl: SZUKAJ PLIKU
ro: CÃUTAÞI FIªIERUL
tr: DOSYA ARA

source: PRINT FILE
ca: IMPRIMEIX FITXER
cs: VYTISKNOUT SOUBOR
pl: WYDRUKUJ PLIK
ro: IMPRIMAÞI FIªIERUL
tr: DOSYA YAZDIR

source: SET PREFERENCES
ca: ESTABLEIX PREFERENCIES
cs: NASTAVENÍ
pl: USTAWIENIA
ro: SETAÞI PREFERINÞELE
tr: AYARLAR

source: Confirm deletes:
ca: Confirma supressions:
cs: Potvrzovat mazání:
pl: Potwierdzanie usuniêæ:
ro: Confirmer effacement:
tr: Silme onayý:

source: Confirm copies:
ca: Confirma còpies:
cs: Potvrzovat kopírování:
pl: Potwierdzanie kopii:
ro: Confirmaþi ºtergerile:
tr: Kopyalama onayý:

source: Confirm overwrites:
ca: Confirma sobreescritures:
cs: Potvrzovat pøepsání:
pl: Potwierdzanie nadpisañ:
ro: Confirmaþi suprascrierile:
tr: Üzerine yazma onayý:

source: Double-click speed:
ca: Velocitat de doble clic:
cs: Rychlost dvojkliku:
pl: Szybko¶æ dwu-klikniêcia:
ro: Vitezã cu dublu clic:
tr: Çift-týklama hýzý:

source: Time format:
ca: Format horari:
cs: Formát èasu:
pl: Format czasu:
ro: Format de timp:
tr: Zaman formatý:

source: Default
ca: Predeterminat
cs: Výchozí
pl: Domy¶lne
ro: Dï¿½faut
tr: Varsayýlan

source: 12H
ca: 12 hores
pl: 12 godz.
ro: 12 ore
tr: 12S

source: 24H
ca: 24 hores
pl: 24 godz.
ro: 24 ore
tr: 24S

source: Date format:
ca: Format de data:
cs: Formát data:
pl: Format daty:
ro: Format de datã:
tr: Tarih formatý:
