Repository: emutos/emutos
Catalog: po/*.po
Languages: ca, cs, pl, ro, tr

source: Get help about <cmd> or list available commands
ca: Obteniu ajuda sobre <cmd> o llista ordres disponibles
pl: Otrzymaj pomoc na temat <komenda> lub wylistuj dostêpne komendy
ro: Obtenir de l'aide ï¿½ propos de <cmd> ou lister les commandes disponibles
tr: <cmd> hakkýnda yardým alýn veya mevcut komutlarý listeleyin

source: Use HELP ALL for help on all commands
ca: Utilitza HELP ALL per ajuda en totes ordres
pl: U¿yj HELP ALL, by wylistowaæ wszystkie komendy
ro: Utiliser HELP ALL pour afficher l'aide de toutes les commandes
tr: Tüm komutlarla ilgili yardým almak için HELP ALL kullanýn

source: Use HELP EDIT for help on line editing
ca: Utilitza HELP EDIT per ajuda en edició en línia
pl: U¿yj HELP EDIT, by wy¶wietliæ pomoc na temat edytowania linii
ro: Utiliser HELP EDIT pour l'aide sur la ligne de commandes
tr: Satýr girme konusunda yardým almak için HELP EDIT'i kullanýn

source: List files (default terse, horizontal)
ca: Llista fitxers (predeterminat curt, horitzonal)
pl: Wylistuj pliki (domy¶lnie zwiêz³e, poziome)
ro: Lister les fichiers (par dï¿½faut : succinct, horizontal)
tr: Dosyalarý listele (varsayýlan olarak kompakt, yatay)

source: Specify -l for detailed list
ca: Especifica -l per llista detallada
pl: Okre¶l -l po szczegó³ow± listê
ro: Spï¿½cifier -l pour une liste dï¿½taillï¿½e
tr: Ayrýntýlý liste için -l belirtin

source: Create directory <dir>
ca: Crea directori <dir>
pl: Stwórz katalog <katalog>
ro: Crï¿½er le rï¿½pertoire <dir>
tr: <dir> dizini oluþtur

source: Set or display console settings:
ca: Estableix o mostra configuració de consola:
pl: Ustaw lub wy¶wietl ustawienia terminala
ro: Dï¿½finir ou afficher les paramï¿½tres de la console:
tr: Konsol ayarlarýný belirleyin veya görüntüleyin:

source: res for screen resolution (0,1)[ST] (0,1,2,4,7)[TT];
ca: res per resolució de pantalla (0,1)[ST] (0,1,2,4,7)[TT];
pl: res dla rozdzielczo¶ci (0,1)[ST] (0,1,2,4,7)[TT];
ro: res: rï¿½solution de l'ï¿½cran (0,1)[ST] (0,1,2,4,7)[TT];
tr: res: ekran çözünürlüðü (0,1) [ST] (0,1,2,4,7) [TT];

source: delay/rate for the keyboard
ca: delay/rate per la teclat
pl: opó¼nienie/szybko¶æ dla klawiatury
ro: dï¿½lai/vitesse de rï¿½pï¿½tition du clavier
tr: klavyenin gecikme oraný

source: Copy <filespec> to standard output,
ca: Copia <especfitx> a sortida estàndard,
pl: Kopiuj <filespec> do standardowego wyj¶cia,
ro: Copier <filespec> vers la sortie standard,
tr: Standart çýktýya <filespec> kopyala,

source: pausing every screenful
ca: pausand cada pantalla
pl: zatrzymuj±c co jeden ekran danych
ro: en marquant une pause ï¿½ chaque page
tr: her ekranda dolduðunda duraklayarak

source: Copy files matching <filespec> to <dir>,
ca: Copia fitxers que coincideixin amb <especfitx> a <dir>,
pl: Kopiuj pliki pasuj±ce do <filespec> to <katalog>,
ro: Copier les fichiers correspondant ï¿½ <filespec> vers <dir>,
tr: <filespec> kalýbýna sahip dosyalarý <dir> konumuna kopyala

source: then delete input files
ca: després suprimeix fitxers d'entrada
pl: a po tym usuñ pliki wej¶cia
ro: puis supprimer les fichiers sources
tr: sonra girdi dosyalarýný sil

source: Set search path for external programs
ca: Estableix camí de cerca per programes externs
pl: Ustaw ¶cie¿kê wyszukiwania dla programów zewnêtrznych
ro: Dï¿½finir le chemin de recherche des programmes externes
tr: Harici programlar için arama yolunu belirle

source: or display current search path
ca: o mostra camí de cerca actual
pl: lub wy¶wietl aktualn± ¶cie¿kê wyszukiwania
ro: ou afficher le chemin de recherche actuel
tr: veya mevcut arama yolunu gösterir

source: Display current drive and directory
ca: Mostra unitat i directori actuals
pl: Wy¶wietl aktualny dysk i katalog
ro: Afficher le lecteur et le rï¿½pertoire courants
tr: Mevcut sürücüyü ve dizini göster

source: Rename <oldname> to <newname>
ca: Canvia nom de <nomvell> a <nomnou>
pl: Zmieñ nazwê <staranazwa> na <nowanazwa>
ro: Renommer <oldname> en <newname>
tr: <oldname> olan adý <newname> olarak deðiþtir

source: Delete files matching <filespec>
ca: Suprimeix fitxers que coincideixin amb <specfiº>
pl: Usuñ pliki pasuj±ce do <filespec>
ro: Supprimer les fichiers correspondant ï¿½ <filespec>
tr: <filespec> kalýbýna sahip dosyalarý sil

source: Specify -q to be prompted each time
ca: Especifica -q per demanar cada cop
pl: Okre¶l -q, by byæ pytanym za ka¿dym razem
ro: Spï¿½cifier -q pour demander une confirmation ï¿½ chaque fois
tr: Her seferinde onay için -q seçeneðini belirtin

source: Delete directory <dir>
ca: Suprimeix directori <dir>
pl: Usuñ katalog <katalog>
ro: Supprimer le rï¿½petoire <dir>
tr: <dir> dizinini sil

source: Show info for <drive> or current drive
ca: Mostra informació de unitat <unitate> o actual
pl: Poka¿ informacje dla <dysk> lub aktualnego dysku
ro: Afficher les informations pour <drive> ou le lecteur courant
tr: <drive> veya mevcut sürücü hakkýnda bilgi göster

source: Display GEMDOS version
ca: Mostra versió de GEMDOS
pl: Wy¶wietl wersjê GEMDOS
ro: Afficher la version du GEMDOS
tr: GEMDOS sürümünü göster

source: Set line wrap or show current status
ca: Estableix ajustament de línia o mostra estat actual
pl: Ustaw zawijanie wierszy lub poka¿ aktualny status
ro: Activer le retour ï¿½ la ligne ou affiche l'ï¿½tat actuel
tr: Bir satýr sonu ayarlar veya mevcut durumu göster

source: up/down arrow = previous/next line in history
ca: fletxa amunt/avall = línia anterior/següent de història
pl: Strza³ka w górê/dó³ = poprzednia/nastêpna linia w historii
ro: flï¿½che haut/bas = ligne prï¿½cï¿½dente/suivante dans l'historique
tr: yukarý/aþaðý ok = geçmiþteki önceki/sonraki satýr

source: left/right arrow = previous/next character
ca: fletxa esquerra/dreta = caràcter anterior/següent
pl: Strza³ka w lewo/prawo = poprzedni/nastêpny znak
ro: flï¿½che gauche/droite = caractï¿½re prï¿½cï¿½dent/suivant
tr: sol/sað ok = önceki/sonraki karakter

source: control-left/right arrow = previous/next word
ca: control-fletxa esquerra/dreta = paraula anterior/següent
pl: Ctrl-lewo/Ctrl-prawo = poprz./nast. s³owo
ro: control-flï¿½che gauche/droite = mot prï¿½cï¿½dent/suivant
tr: kontrol-sol/sað ok = önceki/sonraki kelime

source: invalid mode argument
ca: argument de mode no vàlid
pl: nieprawid³owy argument MODE
ro: argument mode invalide
tr: geçersiz mod parametresi

source: Builtin commands:
ca: Ordres incorporades:
pl: Wbudowane komendy:
ro: Commandes internes :
tr: Yerleþik komutlar:

source: Listing of
ca: Llista de
pl: Listowanie
ro: Contenu de
tr: Listesi

source: Status for CON:
ca: Estat de CON:
pl: Status dla CON:
ro: Statut de CON:
tr: CON Durumu:

source: Resolution:
ca: Rezolució:
pl: Rozdzielczo¶æ:
ro: Rï¿½solution:
tr: Çözünürlük:

source: Keyboard delay:
ca: Retard del teclat:
pl: Opó¼nienie klaw.:
ro: Dï¿½lai de rï¿½pï¿½tition du clavier:
tr: Klavye gecikmesi:

source: Keyboard rate:
ca: Velocitat del teclat:
pl: Szybko¶æ klaw.:
ro: Vitesse de rï¿½pï¿½tition du clavier:
tr: Klavye tekrar oraný:

source: (empty)
ca: (buit)
pl: (puste)
ro: (vide)
tr: (boþ)

source: Delete ALL matching files
ca: Suprimeix TOTS fitxers coincideints
pl: Usun±æ WSZYSTKIE pasuj±ce pliki
ro: Supprimer TOUS les fichiers correspondants
tr: TÜM eþleþen dosyalarý sil

source: Delete file
ca: Suprimeix fitxer
pl: Usun±æ plik
ro: Supprimer le fichier
tr: Dosyayý sil

source: Allocation info for drive
ca: Info d'assignació d'unitat
pl: Informacje o alokacji dla dysku
ro: Utilisation du lecteur
tr: Sürücü için tahsis bilgisi

source: Size (bytes):
ca: Mida (byte):
pl: Rozmiar (bajty):
ro: Taille (octets) :
tr: Boyut (bayt):

source: Bytes used:
ca: Bytes utilitzats:
pl: Bajty u¿yte:
ro: Octets utilisï¿½s :
tr: Kullanýlan bayt:

source: Bytes free:
ca: Bytes lliures:
pl: Bajty wolne:
ro: Octets libres :
tr: Boþ bayt:

source: Total clusters:
ca: Clústers totals:
pl: Grupy:
ro: Total des clusters :
tr: Toplam küme:

source: Free clusters:
ca: Clústers lliures:
pl: Wolne grupy:
ro: Clusters libres :
tr: Boþ kümeler:

source: Sectors/cluster:
ca: Sectors/clúster:
pl: Sektory/grupa:
ro: Secteurs/cluster :
tr: Sektör/küme:

source: Bytes/sector:
pl: Bajty/sektor:
ro: Octets/secteur :
tr: Bayt/sektör:

source: is not a directory
ca: no és un directori
pl: nie jest katalogiem
ro: n'est pas un rï¿½pertoire
tr: bir dizin deðil

source: and
ca: i
pl: i
ro: et
tr: ve

source: Copying
ca: Copiant
pl: Kopiowanie
ro: Copie de
tr: Kopyalanýyor

source: to
ca: a
pl: do
ro: vers
tr: hedef

source: ... deleting
ca: ... suprimint
pl: ... usuwanie
ro: ... suppression
tr: ... siliniyor

source: ... done
ca: ... fat
pl: ... gotowe
ro: ... fait
tr: ... bitti

source: or
ca: o
pl: lub
ro: ou
tr: veya

source: CR to continue ...
ca: Enter per continuar...
pl: CR, by kontynuowa
ro: Entrï¿½e pour continuer...
tr: Devam etmek için ENTER ...

source: --More--
ca: --Més--
pl: --Wiêcej--
ro: --Plus--
tr: --Devam--

source: Welcome to EmuCON2 version
ca: Benvingut a EmuCON2 versió
pl: Witam to EmuCON2, wersja
ro: Bine aþi venit la EmuCON2 versiunea
tr: EmuCON2 sürümüne hoþ geldiniz

source: Type HELP for builtin commands
ca: Escriu HELP per ordres incorporades
pl: Wpisz HELP po wbudowane komendy
ro: Tastaþi HELP pentru comenzile încorporate
tr: HELP, yerleþik komutlarla ilgili yardýmý gösterir

source: warning: no history buffers
ca: advertència: no hi ha buffers d'historial
pl: uwaga: brak buforów historii
ro: avertisment: nu existã tampoane de istoric
tr: uyarý: geçmiþ belleði yok

source: more than one redirection
ca: més d'una redirecció
pl: wiêcej ni¿ jedno przeadresowanie
ro: mai multe redirecþionãri
tr: birden fazla yönlendirme

source: no filename for redirection
ca: cap nom de fitxer per la redirecció
pl: brak nazwy pliku dla przeadresowania
ro: fãrã nume de fiºier pentru redirecþionare
tr: yeniden yönlendirme için dosya adý yok

source: error in quoted field
ca: error al camp citat
pl: b³±d w zacytowanym polu
ro: eroare în câmpul citat
tr: týrnak iþaretli alanda hata

source: error parsing line
ca: error en anàlisi de línia
pl: b³±d analizowania linii
ro: eroare de analizã a liniei
tr: satýr ayrýþtýrýlýrken hata oluþtu

source: file not found
ca: fitxer no trobat
pl: plik nie znaleziony
ro: fiºierul nu a fost gãsit
tr: dosya bulunamadý

source: path not found
ca: camí no trobat
pl: ¶cie¿ka nie znaleziona
ro: calea nu a fost gãsitã
tr: yol bulunamadý

source: no more file handles
ca: no hi ha més manetes de fitxers
pl: brak uchwytów do plików
ro: nu mai existã mânere de fiºiere
tr: baþka dosya tutacaðý yok

source: can't create file
ca: no es pot crear fitxer
pl: nie mo¿na stworzyæ pliku
ro: nu se poate crea fiºierul
tr: dosya yaratýlamýyor

source: not enough memory
ca: no hi ha prou memòria
pl: brak pamiêci
ro: nu este suficientã memorie
tr: yeterli hafýza yok

source: invalid drive
ca: unitat no vàlid
pl: niew³a¶ciwy dysk
ro: unitate invalidã
tr: geçersiz sürücü

source: interrupted
ca: interromput
pl: przerwano
ro: întreruptã
tr: kesildi

source: invalid path
ca: camí no valid
pl: nieprawid³owa ¶cie¿ka
ro: cale invalidã
tr: geçersiz yol

source: can't write to disk (full?)
ca: nu es pot escriure al disc (plet?)
pl: nie mo¿na zapisaæ do dysku (pe³ny?)
ro: nu se poate scrie pe disc (plin?)
tr: diske yazýlamýyor (dolu?)

source: cmdline too long
ca: línia d'ordres massa llarga
pl: linia komendy zbyt d³uga
ro: linie de comandã prea lungã
tr: komut satýrý çok uzun

source: directory not empty
ca: directori no buit
pl: katalog nie jest pusty
ro: directorul nu este gol
tr: dizin boþ deðil

source: can't delete file (read-only?)
ca: no es pot suprimir fitxer (només de lectura?)
pl: nie mo¿na usun±æ pliku (tylko do odczytu?)
ro: nu poate ºterge fiºierul (doar citire?)
tr: dosya silinemiyor (salt-okunur?)

source: invalid parameter
ca: paràmetre no vàlid
pl: niew³a¶ciwy parametr
ro: parametru invalid
tr: geçersiz parametre

source: wrong number of arguments
ca: nombre incorrecte d'arguments
pl: z³a ilo¶æ argumentów
ro: numãr greºit de argumente
tr: yanlýþ parametre adedi

source: error code %ld
ca: codi d'error %ld
pl: kod b³êdu %ld
ro: cod de eroare %ld
tr: hata kodu %ld

source: SS 360 K
ca: Sola cara 360KB

source: DS 720 K
ca: Doble cara 720KB

source: DS 800 K
ca: Sola cara 880KB

source: HD 1.44 M
ca: Alta dens. 1.44MB

source: Normal
pl: Normalnie
ro: Normalã

source: Single sided
cs: Jednostrannì
pl: Jedno-stronna
ro: Singurã faþã

source: Double sided
cs: Oboustrannì
pl: Dwu-stronna
ro: Faþã dublã

source: High density
cs: Vysoká hustota
pl: Wysokiej gêsto¶ci
ro: Densitate mare
